[
	{
		"description"	: "I'm dyslexic and I find it very hard reading tweets on a number of Twitter clients. I'm also very forgetful so I favourite a lot of tweets as a form of bookmarking. So I created a nice reader for reading your favourites back, it's awesome!",
		"href"			: "twitfavs.fsmg.co.uk",
		"name"			: "an-twitfavs",
		"tags"			: [
			"jquery", "php", "twitter", "javascript", "css", "html"
		],
		"title"			: "Twitfavs"
	},
	{
		"description"	: "A friend of mine, Matt Godfrey, wanted a new portfolio site, so, I said to him 'just draw it and I'll put it together', and that's what I did. I think it works really well, his quirky drawings really bring his work and personality to the user. It uses the Flickr API to host all his images so he doesn't have to worry about future-proofing his collection.",
		"href"			: "drawnbymatt.co.uk",
		"name"			: "mg-folio",
		"tags"			: [
			"as3", "puremvc", "flickr", "flash"
		],
		"title"			: "Drawn by Matt"
	},
	{
		"description"	: "The Davos Debates 2009 were a great way that YouTube helped users post their responses and feelings on major questions to the world's leaders. It featured a full custom brand channel gadget, created by me in Actionscript 2, and uses the YouTube Contest API with a Google App Engine (Python) proxy. The gadget proved to be highly successful and a first for YouTube.",
		"name"			: "yt-davos",
		"tags"			: [
			"as2", "flash", "youtube", "contestapi"
		],
		"title"			: "WEF Davos Debates 2009 Channel"
	},
	{
		"description"	: "One of the first projects I did after I left Google was the 'Best of us challenge' YouTube Channel for the IOC. The idea of the channel was to have videos of athletes doing stuff that us mere mortals can compete with, such as, walking on your hands or balancing balls. It's a beautifully designed gadget and my task was to aid the team through the maze that is a YouTube Contest Gadget, helping with coding, integration of the player, the authentication and uploading of videos, creation of the proxy (and caching) all the way through to the tech review process.",
		"name"			: "0043mek",
		"tags"			: [
			"as3", "flash", "youtube", "gdata"
		],
		"title"			: "IOC Best of us YouTube channel"
	},
	{
		"description"	: "This was a personal record breaker of a channel! I built this bad-boy of a gadget in a day! Oh yes, that quick. The best part was that the agency knew exactly what they wanted so there were no changes! It's just recently gone live and hit all the deadlines within good time.",
		"href"			: "youtube.com/lloydstsb",
		"name"			: "bn-lloyds",
		"tags"			: [
			"as3", "puremvc", "flash", "youtube", "gdata"
		],
		"title"			: "Lloyds TSB YouTube channel"
	},
	{
		"description"	: "This has been a huge milestone project for me. The D&amp;AD Inspiration channel is creative showcase in the field of commercial creativity. It's free to enter and work isn't judged by a panel of D&amp;AD judges, instead it's showcased to the world of creativity through this gadget. It features a unique hexagon scrolling interface (for which the maths was hard) and integrates with a middle tier proxy system as well as YouTube GData feeds and the YouTube Contest API.",
		"name"			: "0054yt",
		"tags"			: [
			"as3", "flash", "puremvc", "youtube", "gdata", "contestapi"
		],
		"title"			: "D&amp;AD Inspiration YouTube Channel"
	},
	{
		"description"	: "It's not often that you're asked to create a working prototype for the BBC, and then it's even rarer that that prototype goes into production. I worked with a great set of producers and developers (<a href=\"http://play.blog2t.net/\">Tomek</a> and Parmy) for this project.",
		"href"			: "www.bbc.co.uk/cbbc/topics/staring-contests",
		"name"			: "0069bbc",
		"tags"			: [
			"as3", "puremvc", "flash"
		],
		"title"			: "CBBC staring contests"
	},
	{
		"description"	: "On my meeting to another project, I received a call from the creative agency asking for my help to get this YouTube and GCN centric campaign off the ground and turned around within 4 working days. It started off with a multi-stage YouTube brand channel that coincided with the launch of the teasers and adverts for the new 3D LED TV. I then also had to work on MPUs and a masthead for the YouTube homepage. Overall it was a pretty awesome project, one that had to be done quite fast (within 16 working days) and one that's come off pretty well.",
		"name"			: "0079chi",
		"tags"			: [
			"as3", "flash", "puremvc", "youtube", "gdata"
		],
		"title"			: "Samsung 3D LED TV Campaign"
	},
	{
		"description"	: "This was a really fun project to work on. It was the first time I worked with AddictivePixel and I really hope it's not the last. The concept was simple: create a custom gadget that integrated with the YouTube Contest API and also the GData API to allow OAuth session creation so that users can rate, upload and subscribe to videos and the channel as well as submitting a video without having to authenticate multiple times. ",
		"name"			: "0083bbh",
		"tags"			: [
			"as3", "flash", "puremvc", "youtube", "gdata", "contestapi"
		],
		"title"			: "Tango'd Films YouTube Channel"
	},
	{
		"description"	: "I got this as a late minute project, it was simply to code up the front and back end of the contest, using YouTube to host entry videos and a custom microsite contest API to handle submissions, views and votes. The client mentioned that they didn't mind it being built in Flash, but I opted to do it in HTML, JavaScript and CSS so it would be tablet compatible for all you iPad lovers.",
		"name"			: "0096wc",
		"tags"			: [
			"html", "css", "javascript", "jquery"
		],
		"title"			: "SEGA Sonic The Hedgehog Birthday Contest"
	},
	{
		"description"	: "After I finished working at Google I met a great agency called <a href=\"http://www.psycle.com/\">Psycle</a>. One of the first projects that I worked on with them was for YouTube's Play channel in collaboration with Guggenheim, my part was making the large scrolling wall and now I can tell you whatever you want about getting around FP9's 2,880 max width for display objects.",
		"href"			: "www.youtube.com/play",
		"name"			: "0097ps",
		"tags"			: [
			"as3", "puremvc", "youtube"
		],
		"title"			: "YouTube Play"
	},
	{
		"description"	: "This was a partial build where I had to finish up where another developer had left off. The agency <a href=\"http://mattandgeorge.com/\">Matt&amp;George</a> wanted it to run faster so I stripped out the 3D libraries and used some native Flash trickery to make it run 5x faster.",
		"href"			: "www.daviesmckerr.com/",
		"name"			: "0099mg",
		"tags"			: [
			"as3", "robotlegs", "flash"
		],
		"title"			: "davies+mckerr web site"
	},
	{
		"description"	: "This was quick project I picked up from the agency and had to add all the nice Facebook features such as the like button, posting on one's wall and inviting friends. I then also had to resize the application so it fitted within the dimensions of the Facebook canvas frame and then build an entirely new section for the results of the voting.",
		"name"			: "0103wc",
		"tags"			: [
			"as3", "flash", "facebook"
		],
		"title"			: "Ben 10 Facebook App and Microsite"
	},
	{
		"description"	: "I worked for an agency called <a href=\"http://www.clicktag.co.uk/\">clickTag</a> to create this app for ITV2's show about blood suckers. I never knew just how many people liked vampires until we went live; it had over 500 entries in the first hour.",
		"href"			: "apps.facebook.com/beturned",
		"name"			: "0107ct",
		"tags"			: [
			"as3", "puremvc", "facebook", "flash"
		],
		"title"			: "Vampire diaries Facebook app"
	},
	{
		"description"	: "I was fortunate enough to be given the oppertunity to develop BBH's new web site by the guys at AddictivePixel. The idea was simple: take one part WordPress, apply a cool-ass designer and serve to a developer. The biggest challenge was getting the consistancy correct in terms of the carousel movement, but that's all mathematics, so stay in school kids.",
		"href"			: "bbh.co.uk",
		"name"			: "0111bbh",
		"tags"			: [
			"html", "css", "javascript", "jquery", "wordpress"
		],
		"title"			: "BBH world wide web site"
	},
	{
		"description"	: "This is another project I did with the guys at <a href=\"http://www.psycle.com/\">Psycle</a>, and what a project to work on: The Royal Wedding. My job was to create a CSS/JS carousel and timeline that worked on IE6, oh yes, it was fun! The channel went on to <a href=\"http://www.officialroyalwedding2011.org/blog/2011/May/6/The-Royal-Wedding-online\">break viewing records</a>.",
		"href"			: "youtube.com/theroyalchannel",
		"name"			: "0126ps",
		"tags"			: [
			"javascript", "jquery", "html", "css", "youtube"
		],
		"title"			: "The royal wedding YouTube channel"
	},
	{
		"description"	: "Another <a href=\"http://www.psycle.com/\">Psycle</a> project was the live YouTube Unstaged Twitter gadget. The idea was to get as many people tweeting and posting about the live music gig so that when a certain number of posts were reached, the fans got a free download in realtime.",
		"name"			: "0133ps",
		"tags"			: [
			"as3", "flash"
		],
		"title"			: "YouTube Unstaged"
	},
	{
		"description"	: "Another project from the bad boys at AddictivePixel, this time it was to do the site for the famous Sir Hegarty. It's a simple parallex site, although a fair bit of logic had gone into it to sort out the masking and the animatic movement.",
		"href"			: "hegartyonadvertising.com",
		"name"			: "0134bbh",
		"tags"			: [
			"css", "html", "javascript", "jquery"
		],
		"title"			: "Hegarty on Advertising"
	},
	{
		"description"	: "It's not every day that you're given the oppertunity to work with a <a href=\"http://www.aardman.com/digital/bafta-win-for-aardman-digital/\">BAFTA award winning team</a> so even though the time may've been tight, I couldn't have pass an oppertunity to work with <a href=\"http://www.aardman.com/digital/\">Aardman</a>. It's quite a fun app (designed by the famous <a href=\"http://news.jam-factory.com/\">Gavin</a>), plenty of my Facebook feed has been taken up by posters made with this app.",
		"href"			: "thepirates-movie.co.uk",
		"name"			: "0136aa",
		"tags"			: [
			"as3", "puremvc", "facebook", "flash"
		],
		"title"			: "The Pirates! poster generator"
	},
	{
		"description"	: "I get a few jobs from the USA and one of the great agencies <a href=\"http://www.madeinhaus.com/\">Made in Haus</a> contacted me to help them with their new campaign for Zyrtec. I got to work with the infamous <a href=\"https://twitter.com/#!/drwoohoo\">Dr. Woohoo!</a> as well as <a href=\"https://twitter.com/#!/cwahlers\">Claus</a> and <a href=\"https://twitter.com/#!/TechStyleLAB\">Andy</a>, and a very frisky PM. It was a great laugh and a great project.",
		"href"			: "youtube.com/parksunleashed",
		"name"			: "0139haus",
		"tags"			: [
			"as3", "robotlegs", "youtube", "flash", "gdata"
		],
		"title"			: "Zyrtec Parks Unleashed"
	}
]